mhavill/MRPMG-Docklands/ESP/3_Let's_chat/Code-PIO/ESP32 Server/src/server.cpp
/*******************************
 * Header
 * Name: server.cpp
 * Purpose: Sample Webserver woth 64x32 RGB display
 * Created Date: 26/03/2025
 * Updated Date: 15/1/2026
 *******************************/

/*******************************
 * Includes
 *******************************/
#include <Arduino.h>

#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <arduino-timer.h>
#include <WiFiManager.h>

// #include "secrets.h"

#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <GFX_Layer.hpp>

// Webpage
#include "landing_page.h"
#include "animations_page.h"
#include "text_message_page.h"
#include "vumeter_page.h"
#include <iostream>
#include <string>

// VU Meter and Audio Reactive
// #include "audio_reactive.h"
// #include <FastLED.h>
// #include <LEDMatrix.h>
#include <LEDText.h>
#include <FontMatrise.h>
#include <EEPROM.h>

// NeoPixel
#include "neopixel.hpp"

// Filesystem
#include "FS.h"
#include <LittleFS.h>
#include <AnimatedGIF.h>

/*******************************
 * Protptypes
 *******************************/

void handleNotFound();
void setup();
void loop();
void handleVUMeter();
void handleVUMeterUpdate();
String urlDecode(String input);
void MainPage();
void MainPageSubmit();
void LEDControl();
void layer_draw_callback(int16_t x, int16_t y, uint8_t r_data, uint8_t g_data, uint8_t b_data);
uint16_t colorWheel(uint8_t pos);
void printTextRainbowCentered(int colorWheelOffset, const char *text, int yPos);
void scrollText(int colorWheelOffset, const char *text);
void drawTextCentered(int colorWheelOffset, const char *text, int yPos);
void updateBackground();
bool display_text(void *);
bool display_animations(void *);
bool updateVUmeter(void *);
bool wmloop(void *);
bool server_client_handler(void *);
bool decayPeak(void *);
bool updateEEPROM(void *);

void GIFDraw(GIFDRAW *pDraw);
void *GIFOpenFile(const char *fname, int32_t *pSize);
void GIFCloseFile(void *pHandle);
int32_t GIFReadFile(GIFFILE *pFile, uint8_t *pBuf, int32_t iLen);
int32_t GIFSeekFile(GIFFILE *pFile, int32_t iPosition);
void ShowGIF(char *name);

// VU meter prototypes
void drawPatterns(uint8_t band);
void showIP();
void rainbowBars(uint8_t band, uint8_t barHeight);
void purpleBars(int band, int barHeight);
void centerBars(int band, int barHeight);
void changingBars(int band, int barHeight);
void whitePeak(int band);
void outrunPeak(int band);
void createWaterfall(int band);
void moveWaterfall();

void i2s_install();
void i2s_setpin();
void setupINMP441();
void loopINMP441();

/*******************************
 * Definitions
 *******************************/

#define device "ESP32server"
const int SECOND = 1000;
static float tempC;
// TODO resolve deviceAddress
// static DeviceAddress deviceAddress;
static bool waitForConversion = false;

WebServer server(80);

const int LED = 2;

auto timer = timer_create_default(); // create a timer with default settings

/*  Default library pin configuration for the reference
  you can redefine only ones you need later on object creation
  */
#define R1 25
#define G1 26
#define BL1 27
#define R2 14
#define G2 12
#define BL2 13
#define CH_A 23
#define CH_B 22
#define CH_C 5
#define CH_D 18 // replaced from pin 17 is faulty?
#define CH_E 32 // assign to any available pin if using panels with 1/32 scan
#define CLK 19  // replaced from pin 16 is faulty?
#define LAT 4
#define OE 15

// #define I2S_PORT I2S_NUM_0
#define bufferLen 64
int16_t sBuffer[bufferLen];

// Configure for your panel(s) as appropriate!
#define PIN_E 32
#define PANEL_WIDTH 64
#define PANEL_HEIGHT 32 // Panel height of 64 will required PIN_E to be defined.

#define PANELS_NUMBER 1 // Number of chained panels, if just a single panel, obviously set to 1

#define PANE_WIDTH PANEL_WIDTH *PANELS_NUMBER
#define PANE_HEIGHT PANEL_HEIGHT
#define NUM_LEDS PANE_WIDTH *PANE_HEIGHT

#define FILESYSTEM LittleFS
#define FORMAT_LITTLEFS_IF_FAILED true

#define PANEL_RES_X 64 // Number of pixels wide of each INDIVIDUAL panel module.
#define PANEL_RES_Y 32 // Number of pixels tall of each INDIVIDUAL panel module.
#define PANEL_CHAIN 1  // Total number of panels chained one to another horizontally only.

uint16_t colorWheel(uint8_t pos);
char ssid[32] = {0};

// VU Meter definitions
#define EEPROM_SIZE 5
#define LED_PIN 2
#define M_WIDTH 16
#define M_HEIGHT 16
// #define NUM_LEDS (M_WIDTH * M_HEIGHT) Dulicate definition

#define EEPROM_BRIGHTNESS 0
#define EEPROM_GAIN 1
#define EEPROM_SQUELCH 2
#define EEPROM_PATTERN 3
#define EEPROM_DISPLAY_TIME 4

uint8_t numBands;
uint8_t barWidth;
uint8_t pattern;
uint8_t brightness;
uint16_t displayTime;
bool autoChangePatterns = false;

//------------------------------------------------------------------------------------------------------------------

MatrixPanel_I2S_DMA *dma_display = nullptr;

uint16_t myBLACK = dma_display->color565(0, 0, 0);
uint16_t myWHITE = dma_display->color565(255, 255, 255);
uint16_t myRED = dma_display->color565(255, 0, 0);
uint16_t myGREEN = dma_display->color565(0, 255, 0);
uint16_t myBLUE = dma_display->color565(0, 0, 255);

AnimatedGIF gif;
File f;
int x_offset, y_offset;

//------------------------------------------------------------------------------------------------------------------

//====================== Variables For scrolling Text=====================================================
unsigned long isAnimationDue;
int delayBetweeenAnimations = 18;               // Smaller == faster
int textXPosition = PANEL_WIDTH * CHAIN_LENGTH; // Will start off screen
int textYPosition = PANEL_HEIGHT / 2 - 7;       // center of screen - 8 (half of the text height)
//====================== Variables For scrolling Text=====================================================

// Pointers to this variable will be passed into getTextBounds,
// they will be updated from inside the method
int16_t xOne, yOne;
uint16_t w, h;

unsigned long last_increment = 0;
unsigned long increment_amt = 0;
// Global GFX_Layer object
GFX_Layer gfx_layer_bg(PANEL_WIDTH *CHAIN_LENGTH, PANEL_HEIGHT, layer_draw_callback); // background
GFX_Layer gfx_layer_fg(PANEL_WIDTH *CHAIN_LENGTH, PANEL_HEIGHT, layer_draw_callback); // foreground

GFX_LayerCompositor gfx_compositor(layer_draw_callback);

uint8_t wheelval = 0;

std::string upper_msg;
std::string lower_msg;
std::string top_msg;
uint16_t background = 10;
uint16_t speed = 18;

enum MODE
{
  MODE_TEXT,
  MODE_ANIMATIONS,
  MODE_VUMETER,
  MODE_STOP
} display_mode;

// select which pin will trigger the configuration portal when set to LOW
#define TRIGGER_PIN 36
/****************************
 * GIF Playback Variables
 ****************************/
String gifDir = "/gifs"; // play all GIFs in this directory on the SD card
char filePath[256] = {0};
File root, gifFile;

// TODO Resolve following block
// Global variables for VU meter settings
// int displayTime = 10;
// int brightness = 128;
// int gain = 10;
// int squelch = 5;
// int pattern = 0;
// bool autoChangePatterns = false;

uint8_t peak[] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
uint8_t prevFFTValue[] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
uint8_t barHeights[] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};

// Colors and palettes
DEFINE_GRADIENT_PALETTE(purple_gp){
    0, 0, 212, 255,    // blue
    255, 179, 0, 255}; // purple
DEFINE_GRADIENT_PALETTE(outrun_gp){
    0, 141, 0, 100,   // purple
    127, 255, 192, 0, // yellow
    255, 0, 5, 255};  // blue
DEFINE_GRADIENT_PALETTE(greenblue_gp){
    0, 0, 255, 60,    // green
    64, 0, 236, 255,  // cyan
    128, 0, 5, 255,   // blue
    192, 0, 236, 255, // cyan
    255, 0, 255, 60}; // green
DEFINE_GRADIENT_PALETTE(redyellow_gp){
    0, 200, 200, 200,    // white
    64, 255, 218, 0,     // yellow
    128, 231, 0, 0,      // red
    192, 255, 218, 0,    // yellow
    255, 200, 200, 200}; // white
CRGBPalette16 purplePal = purple_gp;
CRGBPalette16 outrunPal = outrun_gp;
CRGBPalette16 greenbluePal = greenblue_gp;
CRGBPalette16 heatPal = redyellow_gp;
uint8_t colorTimer = 0;
uint8_t divisor = 1; // If 8 bands, we need to divide things by 2

#define I2S_WS 0        // aka LRCL
#define I2S_SD 21        // aka DOUT
#define I2S_SCK 33       // aka BCLK
#define MIN_SHOW_DELAY  15
const i2s_port_t I2S_PORT = I2S_NUM_0;
const int BLOCK_SIZE = 64;

